In [1]:
import pandas as pd

In [12]:
chicago = pd.read_csv("chicago.csv")
chicago["Department"] = chicago["Department"].astype("category")
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [13]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null category
Employee Annual Salary    32062 non-null object
dtypes: category(1), object(3)
memory usage: 784.4+ KB

In [7]:
chicago["Department"].nunique()

35

In [8]:
chicago["Department"].count()

32062

In [11]:
chicago["Department"] = chicago["Department"].astype("category")

## Common String Methods - lower, upper, title, and len

In [14]:
"HELLO WORLD".lower()

'hello world'

In [15]:
"hello world".upper()

'HELLO WORLD'

In [18]:
"hello world".title()

'Hello World'

In [19]:
len("Hello World")

11

In [30]:
chicago["Name"] = chicago["Name"].str.title()
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    Aaron,  Elvia J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  Aaron,  Jeffery M    POLICE OFFICER       POLICE              $84450.00
2     Aaron,  Karina    POLICE OFFICER       POLICE              $84450.00

In [32]:
chicago["Position Title"] = chicago["Position Title"].str.title()
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    Aaron,  Elvia J  Water Rate Taker  WATER MGMNT              $90744.00
1  Aaron,  Jeffery M    Police Officer       POLICE              $84450.00
2     Aaron,  Karina    Police Officer       POLICE              $84450.00

In [34]:
chicago["Department"] = chicago["Department"].str.title()
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    Aaron,  Elvia J  Water Rate Taker  Water Mgmnt              $90744.00
1  Aaron,  Jeffery M    Police Officer       Police              $84450.00
2     Aaron,  Karina    Police Officer       Police              $84450.00

In [35]:
len(chicago["Department"])

32063

In [36]:
chicago["Department"].str.len()

0        11.0
1         6.0
2         6.0
3        16.0
4        11.0
         ...
32058     6.0
32059     6.0
32060     6.0
32061     4.0
32062     NaN
Name: Department, Length: 32063, dtype: float64

## The .str.replace() Method

In [37]:
"Hello world".replace("l", "!")

'He!!o wor!d'

In [39]:
chicago = pd.read_csv("chicago.csv").dropna(how = "all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.tail()

,Name,Position Title,Department,Employee Annual Salary
32057,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,$99528.00
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [42]:
chicago["Department"] = chicago["Department"].str.replace("MGMNT", "MANAGEMENT")
chicago.head(6)

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGEMENT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MANAGEMENT,$106836.00
5,"ABARCA, ANABEL",ASST TO THE ALDERMAN,CITY COUNCIL,$70764.00

In [45]:
chicago["Employee Annual Salary"] = chicago["Employee Annual Salary"].str.replace("$", "").astype(float)

In [46]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null object
Employee Annual Salary    32062 non-null float64
dtypes: float64(1), object(3)
memory usage: 1.2+ MB

## Filtering with String Methods

In [47]:
chicago = pd.read_csv("chicago.csv").dropna(how = "all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.tail()

,Name,Position Title,Department,Employee Annual Salary
32057,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,$99528.00
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [51]:
chicago["Position Title"] = chicago["Position Title"].str.title()
chicago.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null category
Employee Annual Salary    32062 non-null object
dtypes: category(1), object(3)
memory usage: 1.0+ MB

In [52]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",Water Rate Taker,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",Police Officer,POLICE,$84450.00
2,"AARON, KARINA",Police Officer,POLICE,$84450.00
3,"AARON, KIMBERLEI R",Chief Contract Expediter,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",Civil Engineer Iv,WATER MGMNT,$106836.00

In [56]:
mask = chicago["Position Title"].str.contains("Water")

In [57]:
chicago[mask]

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",Water Rate Taker,WATER MGMNT,$90744.00
554,"ALUISE, VINCENT G",Foreman Of Water Pipe Construction,WATER MGMNT,$102440.00
671,"ANDER, PERRY A",Water Chemist Ii,WATER MGMNT,$82044.00
685,"ANDERSON, ANDREW J",District Superintendent Of Water Distribution,WATER MGMNT,$109272.00
702,"ANDERSON, DONALD",Foreman Of Water Pipe Construction,WATER MGMNT,$102440.00
...,...,...,...,...
29669,"VERMA, ANUPAM",Managing Engineer - Water Management,WATER MGMNT,$111192.00
30239,"WASHINGTON, JOSEPH",Water Chemist Iii,WATER MGMNT,$89676.00
30544,"WEST, THOMAS R",Gen Supt Of Water Management,WATER MGMNT,$115704.00
30991,"WILLIAMS, MATTHEW",Foreman Of Water Pipe Construction,WATER MGMNT,$102440.00
31405,"WOODRIDGE, ROBERT L",Foreman Of Water Pipe Construction,WATER MGMNT,$102440.00

In [59]:
mask1 = chicago["Position Title"].str.lower().str.startswith("water")
chicago[mask1]

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",Water Rate Taker,WATER MGMNT,$90744.00
671,"ANDER, PERRY A",Water Chemist Ii,WATER MGMNT,$82044.00
1054,"ASHLEY, KARMA T",Water Chemist Ii,WATER MGMNT,$82044.00
1079,"ATKINS, JOANNA M",Water Chemist Ii,WATER MGMNT,$82044.00
1181,"AZEEM, MOHAMMED A",Water Chemist Ii,WATER MGMNT,$53172.00
...,...,...,...,...
28574,"THREATT, DENISE R",Water Quality Inspector,WATER MGMNT,$62004.00
28602,"TIGNOR, DARRYL B",Water Rate Taker,WATER MGMNT,$78948.00
28955,"TRAVIS COOK, LESLIE R",Water Rate Taker,WATER MGMNT,$78948.00
29584,"VELAZQUEZ, JOHN",Water Rate Taker,WATER MGMNT,$78948.00
30239,"WASHINGTON, JOSEPH",Water Chemist Iii,WATER MGMNT,$89676.00

In [61]:
mask2 = chicago["Position Title"].str.lower().str.endswith("ist")
chicago[mask2]

,Name,Position Title,Department,Employee Annual Salary
184,"AFROZ, NAYYAR",Psychiatrist,HEALTH,$99840.00
308,"ALARCON, LUIS J",Loan Processing Specialist,COMMUNITY DEVELOPMENT,$81948.00
422,"ALLAIN, CAROLYN",Senior Telecommunications Specialist,DoIT,$89880.00
472,"ALLEN, ROBERT",Machinist,WATER MGMNT,$94328.00
705,"ANDERSON, EDWARD M",Sr Procurement Specialist,PROCUREMENT,$91476.00
...,...,...,...,...
31667,"YODER, TERESA G",Archival Specialist,PUBLIC LIBRARY,$74304.00
31688,"YOUNGBLOOM, LAURENCE G",Crimes Surveillance Specialist,OEMC,$19676.80
31717,"YOUNG, KIMBERLY M",Sr Procurement Specialist,PROCUREMENT,$68556.00
31837,"ZAPATA, HUGO",Sr Procurement Specialist,PROCUREMENT,$87324.00
31918,"ZEMKE, RICHARD P",Machinist,AVIATION,$94328.00

## More String Methods - strip, lstrip, and rstrip

In [62]:
chicago = pd.read_csv("chicago.csv").dropna(how = "all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.tail()

,Name,Position Title,Department,Employee Annual Salary
32057,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,$99528.00
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [63]:
"  Hello  World  ".lstrip()

'Hello  World  '

In [65]:
" Hello World   ".rstrip()

' Hello World'

In [66]:
"   Hello   World  ".strip()

'Hello   World'

In [70]:
chicago["Name"] = chicago["Name"].str.strip()
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [72]:
chicago["Position Title"] = chicago["Position Title"].str.strip()

## String Methods on Index and Columns

In [74]:
chicago = pd.read_csv("chicago.csv", index_col="Name").dropna(how = "all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.tail()

,Position Title,Department,Employee Annual Salary
Name,,,
"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,$99528.00
"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [79]:
chicago.index = chicago.index.str.strip().str.title()
chicago.head(3)

                     Position Title   Department Employee Annual Salary
Name
Aaron,  Elvia J    WATER RATE TAKER  WATER MGMNT              $90744.00
Aaron,  Jeffery M    POLICE OFFICER       POLICE              $84450.00
Aaron,  Karina       POLICE OFFICER       POLICE              $84450.00

In [82]:
chicago.columns = chicago.columns.str.upper()
chicago.head(3)

                     POSITION TITLE   DEPARTMENT EMPLOYEE ANNUAL SALARY
Name
Aaron,  Elvia J    WATER RATE TAKER  WATER MGMNT              $90744.00
Aaron,  Jeffery M    POLICE OFFICER       POLICE              $84450.00
Aaron,  Karina       POLICE OFFICER       POLICE              $84450.00

## Split Strings by Characters with .str.split() Method

In [83]:
chicago = pd.read_csv("chicago.csv").dropna(how = "all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.tail()

,Name,Position Title,Department,Employee Annual Salary
32057,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,$99528.00
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [85]:
"Hello My Name Is Boris".split(" ")

['Hello', 'My', 'Name', 'Is', 'Boris']

In [90]:
chicago["Name"].str.split(",").str.get(0).str.title().value_counts()

Williams       293
Johnson        244
Smith          241
Brown          185
Jones          183
              ...
Spremo           1
Brandau          1
Bracamontes      1
Palczynski       1
Chrzanowski      1
Name: Name, Length: 13829, dtype: int64

In [92]:
chicago["Position Title"].str.split(" ").str.get(0).value_counts()

POLICE             10856
FIREFIGHTER-EMT     1509
SERGEANT            1186
POOL                 918
FIREFIGHTER          810
                   ...
CURATOR                1
DEVELOPMENT            1
COMM                   1
EMPLOYABILITY          1
PREPRESS               1
Name: Position Title, Length: 320, dtype: int64

In [100]:
chicago["Name"].str.split(",").str.get(1).str.strip().str.split(" ").str.get(0).value_counts()
#to calculate the most common first name

MICHAEL       1153
JOHN           899
JAMES          676
ROBERT         622
JOSEPH         537
              ...
DOCIA            1
JAMILLE          1
PANAGIOTIS       1
TOYIA            1
MARPESSA         1
Name: Name, Length: 5091, dtype: int64

In [102]:
chicago["Name"].str.split(",", expand = True)

               0              1
0          AARON        ELVIA J
1          AARON      JEFFERY M
2          AARON         KARINA
3          AARON    KIMBERLEI R
4        ABAD JR      VICENTE M
...          ...            ...
32057    ZYGADLO      MICHAEL J
32058   ZYGOWICZ        PETER J
32059   ZYMANTAS         MARK E
32060  ZYRKOWSKI        CARLO E
32061  ZYSKOWSKI        DARIUSZ

[32062 rows x 2 columns]

In [103]:
chicago[["First Name", "Last Name"]] = chicago["Name"].str.split(",", expand = True)

In [104]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary,First Name,Last Name
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,AARON,ELVIA J
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,AARON,JEFFERY M
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,AARON,KARINA
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,AARON,KIMBERLEI R
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00,ABAD JR,VICENTE M

In [107]:
chicago["Position Title"].str.split(" ", expand = True, n = 1)

            0                           1
0       WATER                  RATE TAKER
1      POLICE                     OFFICER
2      POLICE                     OFFICER
3       CHIEF          CONTRACT EXPEDITER
4       CIVIL                 ENGINEER IV
...       ...                         ...
32057     FRM  OF MACHINISTS - AUTOMOTIVE
32058  POLICE                     OFFICER
32059  POLICE                     OFFICER
32060  POLICE                     OFFICER
32061   CHIEF           DATA BASE ANALYST

[32062 rows x 2 columns]